In [304]:
#import 
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine, text
from sqlalchemy_utils import create_database, database_exists
from urllib.parse import quote_plus
import pandas as pd 
import mysql.connector

In [305]:
## Create Engine
username = "root"
password = quote_plus("Ikorodu12") # Using the quote function to make the password compatible
db_name = "tmdb_movies" # this is a new database

In [306]:
# create connection and engine
connection_str = f'mysql+pymysql://{username}:{password}@localhost/{db_name}'
engine = create_engine(connection_str, pool_size=90000, max_overflow=90000)

In [307]:
## Create Database

# Check if the database exists. If not, create it.
if database_exists(connection_str) == False:
  create_database(connection_str)
else:
  print('The database already exists')

The database already exists

In [308]:
# Load data
title_basics = pd.read_csv('title_basics_clean.csv.gz')
tmdb_data = pd.read_csv('tmdb_results_combined.csv.gz')
title_rating = pd.read_csv('title_rating_clean.csv.gz')

### Explore Data

In [309]:
title_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

In [310]:
tmdb_data.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.100,8.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.000,1.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.117,2200.0,PG

In [311]:
title_rating.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1969
1  tt0000002            5.8       263
2  tt0000005            6.2      2612
3  tt0000006            5.1       181
4  tt0000007            5.4       818

### Data Cleaning

#### Drop columns not required in title_basic and tmdb_data

In [312]:
# create a copy
title_basics_clean = title_basics.copy()

In [313]:
# create a copy
tmdb_data_clean = tmdb_data.copy()

**title_basic**

In [314]:
# drop columns not in database specification
column_to_drop = ['titleType','originalTitle', 'isAdult','endYear']
title_basics_clean.drop(columns=column_to_drop, inplace=True)

In [315]:
# columns left
title_basics_clean.columns

Index(['tconst', 'primaryTitle', 'startYear', 'runtimeMinutes', 'genres'], dtype='object')

**tmdb_data**

In [316]:
# keep only required columns
column_to_keep = ['imdb_id', 'revenue', 'budget', 'certification']
tmdb_data_clean = tmdb_data_clean[column_to_keep]
tmdb_data_clean.head()

     imdb_id     revenue      budget certification
0          0         NaN         NaN           NaN
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694  12854953.0    150000.0            PG

In [317]:
## remove rows from tmdb data where imdb_id = 0
remove_rows = tmdb_data_clean[tmdb_data_clean.imdb_id == '0'].index
tmdb_data_clean.drop(remove_rows, inplace=True)

### Preparing and saving data to our database

### 1. Getting List of Unique Genres

In [318]:
title_basics_clean.head()

,tconst,primaryTitle,startYear,runtimeMinutes,genres
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70,Drama
2,tt0069049,The Other Side of the Wind,2018.0,122,Drama
3,tt0088751,The Naked Monster,2005.0,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,Crime and Punishment,2002.0,126,Drama

In [319]:
## create a col with a list of genres
title_basics_clean['genres_split'] = title_basics_clean['genres'].str.split(',')
title_basics_clean.head()

,tconst,primaryTitle,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70,Drama,[Drama]
2,tt0069049,The Other Side of the Wind,2018.0,122,Drama,[Drama]
3,tt0088751,The Naked Monster,2005.0,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,Crime and Punishment,2002.0,126,Drama,[Drama]

In [320]:
## exploding the column of lists
exploded = title_basics_clean.explode('genres_split')
exploded.head()

,tconst,primaryTitle,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70,Drama,Drama
2,tt0069049,The Other Side of the Wind,2018.0,122,Drama,Drama

In [321]:
# unique genres
unique_genres = sorted(exploded['genres_split'].unique())
unique_genres[:10]

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy']

In [322]:
# drop genres_split from title_basics
title_basics_clean.drop(columns= 'genres_split', inplace=True)
title_basics_clean.columns

Index(['tconst', 'primaryTitle', 'startYear', 'runtimeMinutes', 'genres'], dtype='object')

### 2. Create a new title_genres table

In [323]:
title_genres = exploded[['tconst', 'genres_split']]
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

### 3. Create a genre mapper dictionary to replace string genres with integers

In [324]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

### 4. Replace the string genres in title_genres with the new integer ids.

In [325]:
title_genres.columns

Index(['tconst', 'genres_split'], dtype='object')

In [326]:
# using dictionary for mapping
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')

C:\Users\Testing\AppData\Local\Temp\ipykernel_11764\1807086211.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)

In [327]:
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

### 5. Convert the genre map dictionary into a dataframe.

In [328]:
genres_lookup = pd.DataFrame({'Genre_Name': genre_map.keys(),
                             'Genre_ID' : genre_map.values()})

In [329]:
genres_lookup

    Genre_Name  Genre_ID
0       Action         0
1        Adult         1
2    Adventure         2
3    Animation         3
4    Biography         4
5       Comedy         5
6        Crime         6
7        Drama         7
8       Family         8
9      Fantasy         9
10   Game-Show        10
11     History        11
12      Horror        12
13       Music        13
14     Musical        14
15     Mystery        15
16        News        16
17  Reality-TV        17
18     Romance        18
19      Sci-Fi        19
20       Short        20
21       Sport        21
22   Talk-Show        22
23    Thriller        23
24         War        24
25     Western        25

### 6. Creating a dataype schema for to_sql:

In [330]:
## Example
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = title_basics_clean['tconst'].fillna('').map(len).max()
title_len = title_basics_clean['primaryTitle'].fillna('').map(len).max()
imdb_len = tmdb_data_clean['imdb_id'].fillna('').map(len).max()
cert_len = tmdb_data_clean['certification'].fillna('').map(len).max()
name_len= genres_lookup['Genre_Name'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer(),
    'revenue': Float(),
    'budget': Float(),
    'imdb_id': String(imdb_len+1),
    'certification': Text(cert_len+1),
    'genre_id': Integer(),
    'Genre_Name': Text(name_len+1),
    'numVotes': Integer(),
    'averageRating': Float()
}

### 7. Run df.to_sql with the dtype argument.

In [331]:
# Save to sql with dtype and index=False
title_basics_clean.to_sql('title_basics',engine,dtype= df_schema,if_exists='replace', index= False)

81710

In [332]:
# save to sql database
tmdb_data_clean.to_sql('tmdb_data',engine,dtype= df_schema,if_exists='replace', index= False)

2566

In [333]:
# save to sql database
title_rating.to_sql('title_ratings',engine,dtype= df_schema,if_exists='replace', index= False)

497874

In [334]:
# save to sql database
title_genres.to_sql('title_genres',engine,dtype= df_schema,if_exists='replace', index= False)

153095

In [335]:
# save to sql database
genres_lookup.to_sql('genres',engine,dtype= df_schema,if_exists='replace', index= False)

26

### 8. Set Primary key for each table in database

In [336]:
mydb = mysql.connector.connect(
  host="localhost",
  user= username,
  password= password,
  database= db_name
)

mycursor = mydb.cursor()

In [337]:
# set tconst as primary key
mycursor.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')
mycursor.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [338]:
# set primary key for tmdb data
mycursor.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [339]:
# set primary key for genres
mycursor.execute('ALTER TABLE genres ADD PRIMARY KEY (`Genre_ID`);')

In [340]:
# show all tables
query = """Show tables;"""
with engine.begin() as conn:
  df = pd.read_sql_query(sql=text(query), con=conn)
df

  Tables_in_tmdb_movies
0                genres
1          title_basics
2          title_genres
3         title_ratings
4             tmdb_data